frontend/controllers/CommentController.php

SELECT * FROM `comment` WHERE `event_id`='42' ORDER BY `id` DESC LIMIT 6
SELECT COUNT(*) FROM `comment` WHERE `event_id`='42'
---
    public function actionList($event_id){
        \Yii::$app->response->format = Response::FORMAT_JSON;
        $dp                          = new ActiveDataProvider();
        $dp->query                   = Comment::find()->with('user')->where(['event_id' => $event_id])->orderBy(['id' => SORT_DESC]);
        $dp->pagination->pageSize    = 6;
        return [
            'items'      => $dp->getModels(),
            'pageCount'  => $dp->getPagination()->getPageCount(),
            'totalCount' => $dp->getTotalCount(),
            'page'       => $dp->pagination->page,
            'count'      => $dp->getCount(),
        ];