frontend/controllers/EventController.php

SELECT * FROM `event_subscriber` WHERE (`event_id`='42') AND (`user_id`=2)
DELETE FROM `event_subscriber` WHERE `id`='105'
---
	public function actionSubscribe($id)
	{
		if (!$id or !\Yii::$app->request->isAjax) {
			throw new NotFoundHttpException;
		}
		$userId = \Yii::$app->user->identity->id;
		$subscribed = EventSubscriber::find()->where(['event_id' => $id, 'user_id' => $userId])->one();
		if ($subscribed) {
			$delete = $subscribed->delete();

SELECT * FROM `event_subscriber` WHERE `event_id`='42' ORDER BY `id` DESC LIMIT 12
SELECT * FROM `user` WHERE `id`=2
SELECT COUNT(*) FROM `event_subscriber` WHERE `event_id`='42'
---
	public function actionEventSubscribers($event_id)
	{
		if (!\Yii::$app->request->isAjax) {
			throw new NotFoundHttpException;
		}
		\Yii::$app->response->format = Response::FORMAT_JSON;
		$dp = new ActiveDataProvider();
		$dp->query = EventSubscriber::find()
									->with('user')
									->where(['event_id' => $event_id])
									->orderBy(['id' => SORT_DESC]);
		$dp->pagination->pageSize = 12;
		return [
			'items'      => $dp->getModels(),
			'pageCount'  => $dp->getPagination()->getPageCount(),
			'totalCount' => $dp->getTotalCount(),
			'page'       => $dp->pagination->page,
			'count'      => $dp->getCount(),
		];