frontend/controllers/SiteController.php

    public function actionIndex()
    {
		\Yii::$app->user->setReturnUrl(['site/index']);
		$eventTypeList = Yii::$app->db->cache(function(){
			return EventType::find()->indexBy('id')->asArray()->all();
---
SELECT * FROM `event_type`