frontend/controllers/UserController.php

    public function actionWall($id = null)
    {
        /**
         * @var $userView User
         */
        $userView = $id && \Yii::$app->user->identity != $id ? User::findOne($id) : \Yii::$app->user->identity;
---
SELECT * FROM `user` WHERE `id`='2'

    public function actionEventsSubscribe($id)
    {
        if (!\Yii::$app->request->isAjax)
            throw new NotFoundHttpException;
        $params = array_merge([
            'pageSize' => 12
        ], $_GET);
        $user = User::findOne($id);
---
SELECT * FROM `user` WHERE `id`='2'

    public function actionEventsCreated($id)
    {
		/**
		 * @var User $user
		 */
        if (!\Yii::$app->request->isAjax)
            throw new NotFoundHttpException;
        $params = array_merge([
            'pageSize' => 12
        ], $_GET);

        $user = User::findOne($id);
---
SELECT * FROM `user` WHERE `id`='2'