common/models/User.php

SELECT 1 FROM `user_subscriber` WHERE (`user_id`=2) AND (`subscriber_id`=2)
---
	public function isSubscribed(User $user)
	{
		return $this->getSubscribers()->onCondition(['subscriber_id' => $user->id])->exists();