common/models/Wall.php

    public function afterSave($insert, $changedAttributes)
    {
        parent::afterSave($insert, $changedAttributes);
        if ($insert) {
            $rows = [];
            foreach ($this->_wallPostList as $row) {
                $rows[] = [$row->target_type, $row->target_id, $this->id, $row->personal];
            }
            if ($rows) {
                return Yii::$app->db->createCommand()
                    ->batchInsert(WallPost::tableName(), ['target_type', 'target_id', 'wall_id', 'personal'], $rows)
                    ->execute();
---
INSERT INTO `wall_post` (`target_type`, `target_id`, `wall_id`, `personal`) VALUES (1, '2', '312', 0), (1, '22', '312', 1), (1, '38', '312', 1)