frontend/views/user/index.php

					class="badge badge-default"><?= $userView->getEventSubscribe()->count() ?></span>
			</a>
			<a id="menu-event-create" href="#" class="list-group-item menu-item" data-action="eventCreated">
				Создал события <span class="badge badge-default"><?= $userView->getEventCreate()->count() ?></span>
---
SELECT COUNT(*) FROM `event` WHERE `user_id`=2

				Подписан <span class="badge badge-default"><?= $userView->getSigned()->count() ?></span>
			</a>
			<a id="menu-subscribers" href="#" class="list-group-item menu-item" data-action="subscribers">
				Подписчики <span class="badge badge-default"><?= $userView->getSubscribers()->count() ?></span>
---
SELECT COUNT(*) FROM `user_subscriber` WHERE `user_id`=2